package ru.homework.teachingProject;


/**
 * ЗАДАЧА
 * Создайте три класса Человек, Кот, Робот, которые не наследуются от одного класса.
 * Эти классы должны уметь бегать и прыгать (методы просто выводят информацию о действии в консоль).
 * Создайте два класса: беговая дорожка и стена, при прохождении через которые, участники должны выполнять соответствующие действия (бежать или прыгать),
 * результат выполнения печатаем в консоль (успешно пробежал, не смог пробежать и т.д.).
 * Создайте два массива: с участниками и препятствиями, и заставьте всех участников пройти этот набор препятствий.
 * * У препятствий есть длина (для дорожки) или высота (для стены), а участников ограничения на бег и прыжки.
 * Если участник не смог пройти одно из препятствий, то дальше по списку он препятствий не идет.
 *
 * РЕШЕНИЕ
 * Для начала, мы должны с вами понять, как нам связать между собой классы Cat, Human и Robot, если прямое наследование от суперкласса нам запретили по условию задачи.
 * Мы можем воспользоваться интерфейсом.
 * Например, следующий интерфейс будет использоваться для связи бегунов:
 */

public class Championship {

    public static void main(String[] args) {

        // Объявим бегунов
        Runner[] runners = {
                new Cat("Барсик", 1500, 300),
                new Cat("Персик", 1700, 220),
                new Robot("R2D2", 99999, 0),
                new Robot("C3PO", 5000, 50),
                new Human("Петя", 2500, 150),
                new Human("Вася", 3500, 120)
        };

        // Объявим препятствия
        Obstacle[] obstacles = {
                new Track(1200),
                new Wall(30),
                new Track(2000),
                new Wall(140),
                new Track(3000),
                new Wall( 250)
        };

        // Организуем два цикла
        // Проходим по всем бегунам и внутри каждого бегуна, прогоняем его по всем препятствиям
        for (Runner r : runners) {
            for (Obstacle o : obstacles) {
                // В зависимости от типа препятствия, вызываем тот или иной метод (бежать или прыгать)
                if (o instanceof Track) {
                    if (!r.run(o.getLength()))
                        break; // Если нам не удалось пробежать или перепрыгнуть препятствия, выходит из внутреннего цикла
                    // На этом забег для нашего бегуна заканчивается и мы переходим к следующему "спортсмену"
                } else if (o instanceof  Wall) {
                    if (!r.jump(o.getHeight()))
                        break;
                }
            }
        }
    }

}
